package com.ydcqy.ynet.rpc;

import ch.qos.logback.classic.Level;
import ch.qos.logback.classic.LoggerContext;
import com.ydcqy.ynet.client.AbstractNettyClient;
import com.ydcqy.ynet.codec.Codec;
import com.ydcqy.ynet.handler.Handler;
import com.ydcqy.ynet.util.SerializationType;
import io.netty.util.ResourceLeakDetector;
import org.slf4j.Logger;
import org.slf4j.LoggerFactory;

import java.lang.reflect.Field;
import java.net.InetSocketAddress;
import java.util.Arrays;
import java.util.concurrent.ExecutorService;
import java.util.concurrent.Executors;
import java.util.concurrent.atomic.AtomicInteger;
import java.util.concurrent.locks.LockSupport;

/**
 * @author xiaoyu
 */
public class YrpcClient extends AbstractNettyClient {
    private static final Logger LOG = LoggerFactory.getLogger(YrpcClient.class);

//    static {
//        try {
//            Field rootLoggerField = LoggerContext.class.getDeclaredField("root");
//            rootLoggerField.setAccessible(true);
//            ch.qos.logback.classic.Logger rootLogger = (ch.qos.logback.classic.Logger) rootLoggerField.get(LoggerFactory.getILoggerFactory());
//            rootLogger.setLevel(Level.INFO);
//        } catch (Exception e) {
//            e.printStackTrace();
//        }
//    }

    private static final Handler handler = new YrpcClientHandler();

    public YrpcClient(String remoteHost, int remotePort) {
        super(remoteHost, remotePort);
    }

    public YrpcClient(InetSocketAddress remoteAddress) {
        super(remoteAddress);
    }

    @Override
    public Codec getCodec() {
        return new YrpcClientCodec(SerializationType.JSON);
    }

    @Override
    public Handler getHandler() {
        return handler;
    }

    public static void main(String[] args) throws Exception {
        ResourceLeakDetector.setLevel(ResourceLeakDetector.Level.ADVANCED);
        YrpcClient client = new YrpcClient("127.0.0.1", 1111);
        ExecutorService executorService = Executors.newFixedThreadPool(20);
        AtomicInteger n = new AtomicInteger();
        for (int i = 0; i < 1; i++) {
//            Thread.sleep(1);
            executorService.execute(new Runnable() {
                @Override
                public void run() {
                    try {
                        YrpcRequest request = new YrpcRequest();
                        String s = n.incrementAndGet() + "";
                        request.setRequestId(s);
                        request.setInterfaceName(HelloService.class.getName());
                        request.setMethodName("sayHiJson");
//                        request.setParams(Arrays.asList(StringValue.newBuilder().setValue("张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或张三哈哈哈哈或或或或或或或或或或或").build()
//                                , Int32Value.newBuilder().setValue(101).build()
//                        ).toArray());
                        request.setParams(Arrays.asList("张三", 123).toArray());

                        YrpcResponse response = client.send(request);
                        LOG.info("结果: requestId: {}, result: {}, errMsg: {}", response.getRequestId(), response.getResult(), response.getErrMsg());
                    } catch (Exception e) {
                        e.printStackTrace();
                    }
                }
            });
        }
        LockSupport.park();
    }
}
